Learning Rails 5- Rails from the Outside In/app/controllers/welcome_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
    @message = "Welcome!"
    @count = 2
    @bonus = "This message came from the controller."
    @entries = Entry.all